# Step 1: Asking questions:-
# Objective of this EDA project is:
# 1. The aims is to study how sales strategies can be improved and optimized. 

# 2. Explore the Walmart Sales data to understand top performing branches and products, sales trend of different products, customer behaviour.

# Step 2: Data Wrangling

# 2.1 Data Gathering from Direct Database

In [35]:
db_name = "salesdatawalmart"
db_host = "localhost"
db_username = "root"
db_password = ""

In [36]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\asus\appdata\local\programs\python\python311\lib\site-packages (8.3.0)

In [37]:
import mysql.connector
import pandas as pd

In [38]:
try:
    conn=mysql.connector.connect(host=db_host,
                          port=int(3308),
                          user='root',
                          passwd=db_password,
                          db=db_name)
except Exception as e:
    print(e)

# 2.2 Assessing Data

In [39]:
pd.read_sql_query("SELECT * FROM sales",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_66552\454738777.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT * FROM sales",conn)

,invoice_id,branch,city,customer_type,gender,product_line,unit_price,quantity,tax_pct,total,date,time,payment,cogs,gross_margin_pct,gross_income,rating,time_of_day,day,MonthName
0,101-17-6199,A,Yangon,Normal,Male,Food and beverages,45.79,7,16.0265,336.5565,2019-03-13,0 days 19:44:00,Credit card,320.53,4.761905,16.0265,7.0,Evening,Wednesday,March
1,101-81-4070,C,Naypyitaw,Member,Female,Health and beauty,62.82,2,6.2820,131.9220,2019-01-17,0 days 12:36:00,Ewallet,125.64,4.761905,6.2820,4.9,Afternoon,Thursday,January
2,102-06-2002,C,Naypyitaw,Member,Male,Sports and travel,25.25,5,6.3125,132.5625,2019-03-20,0 days 17:52:00,Cash,126.25,4.761905,6.3125,6.1,Evening,Wednesday,March
3,102-77-2261,C,Naypyitaw,Member,Male,Health and beauty,65.31,7,22.8585,480.0285,2019-03-05,0 days 18:02:00,Credit card,457.17,4.761905,22.8585,4.2,Evening,Tuesday,March
4,105-10-6182,A,Yangon,Member,Male,Fashion accessories,21.48,2,2.1480,45.1080,2019-02-27,0 days 12:22:00,Ewallet,42.96,4.761905,2.1480,6.6,Afternoon,Wednesday,February
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
994,892-05-6689,A,Yangon,Normal,Female,Home and lifestyle,28.32,5,7.0800,148.6800,2019-03-11,0 days 13:28:00,Ewallet,141.60,4.761905,7.0800,6.2,Afternoon,Monday,March
995,894-41-5205,C,Naypyitaw,Normal,Female,Food and beverages,43.18,8,17.2720,362.7120,2019-01-19,0 days 19:39:00,Credit card,345.44,4.761905,17.2720,8.3,Evening,Saturday,January
996,895-66-0685,B,Mandalay,Member,Male,Food and beverages,18.08,3,2.7120,56.9520,2019-03-05,0 days 19:46:00,Ewallet,54.24,4.761905,2.7120,8.0,Evening,Tuesday,March
997,896-34-0956,A,Yangon,Normal,Male,Fashion accessories,21.32,1,1.0660,22.3860,2019-01-26,0 days 12:43:00,Cash,21.32,4.761905,1.0660,5.9,Afternoon,Saturday,January
998,898-04-2717,A,Yangon,Normal,Male,Fashion accessories,76.40,9,34.3800,721.9800,2019-03-19,0 days 15:49:00,Ewallet,687.60,4.761905,34.3800,7.5,Afternoon,Tuesday,March

# Summary of Data

# About Data
- The dataset was obtained from the Kaggle Walmart Sales Forecasting Competition. This dataset contains sales transactions from a three different branches of Walmart, respectively located in Mandalay, Yangon and Naypyitaw. The data contains 17 columns and 1000 rows:

Summary categorized data set into Product Information, Sales Information, and Customer Information:

1. **Product Information:**
   - Product_Line: Line of the product sold.
   - Unit_Price: Price of each product.
   - Quantity: Amount of the product sold.
   - VAT: Amount of tax on the purchase.
   - COGS (Cost Of Goods Sold): Cost of goods sold.
   - Gross_Margin_Percentage: Gross margin percentage.

2. **Sales Information:**
   - Invoice_ID: Unique identifier for each sales transaction.
   - Branch: Branch at which sales were made (Mandalay, Yangon, Naypyitaw).
   - City: Location of the branch.
   - Date: Date on which the purchase was made.
   - Time: Time at which the purchase was made.
   - Payment_Method: Method of payment used.
   - Total: Total cost of the purchase.
   - Gross_Income: Gross income generated from the sale.
   - Rating: Rating associated with the purchase experience.

3. **Customer Information:**
   - Customer_Type: Type of the customer (e.g., Member, Normal).
   - Gender: Gender of the customer making the purchase.
   - Marital_Status: Marital status of the customer.

# Column Description

1. **Invoice_ID**: Unique identifier assigned to each sales transaction. There are 1000 unique invoices.

2. **Branch**: Branch at which sales were made, categorized as 'Mandalay', 'Yangon', or 'Naypyitaw'.

3. **City**: Location of the branch.

4. **Customer_Type**: Type of the customer, indicating whether they are a member or a normal customer.

5. **Gender**: Gender of the customer making the purchase, categorized as 'Male', 'Female', or other.

6. **Product_Line**: Product line of the product sold.

7. **Unit_Price**: Price of each product.

8. **Quantity**: Amount of the product sold.

9. **VAT**: Amount of tax on the purchase.

10. **Total**: Total cost of the purchase.

11. **Date**: Date on which the purchase was made.

12. **Time**: Time at which the purchase was made.

13. **Payment_Method**: Method of payment used for the transaction.

14. **COGS (Cost Of Goods Sold)**: Cost of goods sold.

15. **Gross_Margin_Percentage**: Gross margin percentage.

16. **Gross_Income**: Gross income generated from the sale.

17. **Rating**: Rating associated with the purchase experience.

# Issues with Dataset

### 1. There are no issues with the dataset because all values come directly from the database, and there are no missing values either.
### 2. No need of Data Cleaning

# 2.3 Feature Engineering
- Add a new column named time_of_day to give insight of sales in the Morning, Afternoon and Evening. This will help answer the question on which part of the day most sales are made.
- Add a new column named day that contains the extracted days of the week on which the given transaction took place (Mon, Tue, Wed, Thur, Fri). This will help answer the question on which week of the day each branch is busiest.
- Add a new column named MonthName that contains the extracted months of the year on which the given transaction took place (Jan, Feb, Mar). Help determine which month of the year has the most sales and profit.

In [ ]:
cursor = conn.cursor()

# Execute the ALTER TABLE statement
cursor.execute("""
    ALTER TABLE sales
ADD COLUMN time_of_day VARCHAR(20);
""")

# Commit the transaction
conn.commit()

# Close the cursor and the connection
cursor.close()

In [ ]:
cursor = conn.cursor()

# Execute the ALTER TABLE statement
cursor.execute("""
    UPDATE sales
SET time_of_day = CASE 
                        WHEN time BETWEEN '00:00:00' AND '12:00:00' THEN 'Morning'
                        WHEN time BETWEEN '12:00:01' AND '17:00:00' THEN 'Afternoon'
                        ELSE 'Evening'
                  END;
""")

# Commit the transaction
conn.commit()

# Close the cursor and the connection
cursor.close()

In [ ]:
cursor = conn.cursor()

# Execute the ALTER TABLE statement
cursor.execute("""
    ALTER TABLE sales
ADD COLUMN day VARCHAR(20);
""")

# Commit the transaction
conn.commit()

# Close the cursor and the connection
cursor.close()

In [ ]:
cursor = conn.cursor()

# Execute the ALTER TABLE statement
cursor.execute("""
    UPDATE sales
        SET day = DAYNAME(date)
""")

# Commit the transaction
conn.commit()

# Close the cursor and the connection
cursor.close()

In [ ]:
cursor = conn.cursor()

# Execute the ALTER TABLE statement
cursor.execute("""
    ALTER TABLE sales
        ADD COLUMN MonthName VARCHAR(20);
""")

# Commit the transaction
conn.commit()

# Close the cursor and the connection
cursor.close()

In [ ]:
cursor = conn.cursor()

# Execute the ALTER TABLE statement
cursor.execute("""
    UPDATE sales
        SET MonthName = MONTHNAME(date)
""")

# Commit the transaction
conn.commit()

# Close the cursor and the connection
cursor.close()

# 3. Exploratory Data Analysis (EDA): Exploratory data analysis is done to answer the listed questions and aims of this project.

# Business Questions To Answer

## Generic Question
Q1. How many unique cities does the data have?

In [55]:
pd.read_sql_query("SELECT distinct city AS City FROM sales",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\557403998.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT distinct city AS City FROM sales",conn)

        City
0     Yangon
1  Naypyitaw
2   Mandalay

Q2. In which city is each branch?

In [54]:
pd.read_sql_query("SELECT distinct city AS City , branch AS Branch FROM sales",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\3034155680.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT distinct city AS City , branch AS Branch FROM sales",conn)

        City Branch
0     Yangon      A
1  Naypyitaw      C
2   Mandalay      B

## Product
Q1. How many unique product lines does the data have?

In [53]:
pd.read_sql_query("SELECT distinct product_line AS 'Product Line' FROM sales",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\3374838802.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT distinct product_line AS 'Product Line' FROM sales",conn)

             Product Line
0      Food and beverages
1       Health and beauty
2       Sports and travel
3     Fashion accessories
4      Home and lifestyle
5  Electronic accessories

Q2. What is the most common payment method?

In [52]:
pd.read_sql_query("SELECT payment AS 'Payment Method' FROM sales group by(payment) order by count(payment) Desc limit 1",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\160447823.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT payment AS 'Payment Method' FROM sales group by(payment) order by count(payment) Desc limit 1",conn)

  Payment Method
0        Ewallet

Q3. What is the most selling product line?

In [51]:
pd.read_sql_query("SELECT product_line AS 'Product Line' FROM sales group by(product_line) order by count(product_line) Desc limit 1",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\2715238353.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT product_line AS 'Product Line' FROM sales group by(product_line) order by count(product_line) Desc limit 1",conn)

          Product Line
0  Fashion accessories

Q4. What is the total revenue by month?

In [49]:
pd.read_sql_query("SELECT MonthName AS 'Month Name', sum(total) AS 'Total Revenue' FROM sales group by(MonthName) order by sum(total) Desc",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\3364276636.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT MonthName AS 'Month Name', sum(total) AS 'Total Revenue' FROM sales group by(MonthName) order by sum(total) Desc",conn)

  Month Name  Total Revenue
0    January    116291.8680
1      March    109455.5070
2   February     96874.3545

Q5. What month had the largest COGS?

In [50]:
pd.read_sql_query("SELECT MonthName AS 'Month Name', sum(cogs) AS 'Total Cogs' FROM sales group by(MonthName) order by sum(cogs) Desc limit 1",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\513184937.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT MonthName AS 'Month Name', sum(cogs) AS 'Total Cogs' FROM sales group by(MonthName) order by sum(cogs) Desc limit 1",conn)

  Month Name  Total Cogs
0    January   110754.16

 Q6. What product line had the largest revenue?

In [47]:
pd.read_sql_query("SELECT product_line AS 'Product Line', sum(total) AS 'Total Revenue' FROM sales group by(MonthName) order by sum(total) Desc limit 1",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\3184582760.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT product_line AS 'Product Line', sum(total) AS 'Total Revenue' FROM sales group by(MonthName) order by sum(total) Desc limit 1",conn)

        Product Line  Total Revenue
0  Health and beauty     116291.868

Q7. What is the city with the largest revenue?

In [56]:
pd.read_sql_query("SELECT city AS City, sum(total) AS 'Total Revenue' FROM sales group by(city) order by sum(total) Desc limit 1",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\681619256.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT city AS City, sum(total) AS 'Total Revenue' FROM sales group by(city) order by sum(total) Desc limit 1",conn)

        City  Total Revenue
0  Naypyitaw    110568.7065

Q8. What product line had the largest VAT?

In [58]:
pd.read_sql_query("SELECT product_line AS 'Product Line', sum(tax_pct) AS 'Total VAT' FROM sales group by(product_line) order by sum(tax_pct) Desc limit 1",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\3615065541.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT product_line AS 'Product Line', sum(tax_pct) AS 'Total VAT' FROM sales group by(product_line) order by sum(tax_pct) Desc limit 1",conn)

         Product Line  Total VAT
0  Food and beverages   2673.564

Q9. Which branch sold more products than average product sold?

In [60]:
pd.read_sql_query("SELECT branch AS Branch, sum(quantity) AS 'Total Quantity' FROM sales group by(branch) having sum(quantity) > (SELECT avg(quantity) FROM sales)",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\2906046489.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT branch AS Branch, sum(quantity) AS 'Total Quantity' FROM sales group by(branch) having sum(quantity) > (SELECT avg(quantity) FROM sales)",conn)

  Branch  Total Quantity
0      A          1859.0
1      B          1811.0
2      C          1831.0

Q10. What is the most common product line by gender?

In [65]:
pd.read_sql_query("SELECT gender AS Gender, product_line AS 'Product Line', count(gender) AS Gender_Count FROM sales group by gender, product_line order by Gender_Count Desc",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\1210337598.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT gender AS Gender, product_line AS 'Product Line', count(gender) AS Gender_Count FROM sales group by gender, product_line order by Gender_Count Desc",conn)

    Gender            Product Line  Gender_Count
0   Female     Fashion accessories            95
1   Female      Food and beverages            90
2     Male       Health and beauty            88
3   Female       Sports and travel            88
4     Male  Electronic accessories            86
5     Male      Food and beverages            84
6   Female  Electronic accessories            84
7     Male     Fashion accessories            82
8     Male      Home and lifestyle            81
9   Female      Home and lifestyle            79
10    Male       Sports and travel            78
11  Female       Health and beauty            64

Q11. What is the average rating of each product line?

In [67]:
pd.read_sql_query("SELECT product_line AS 'Product Line', avg(rating) AS 'Avg. Rating' FROM sales group by product_line",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\1846611455.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT product_line AS 'Product Line', avg(rating) AS 'Avg. Rating' FROM sales group by product_line",conn)

             Product Line  Avg. Rating
0  Electronic accessories      6.92412
1     Fashion accessories      7.04520
2      Food and beverages      7.11322
3       Health and beauty      7.00263
4      Home and lifestyle      6.83750
5       Sports and travel      6.91446

## Sales
Q1. Number of sales made in each time of the day per weekday

In [71]:
pd.read_sql_query("SELECT time_of_day AS 'Time of Day', day AS 'Weekday', count(*) AS 'Total Sale' FROM sales WHERE day NOT IN ('Sunday','Saturday')  group by time_of_day, day ORDER BY 'Total Sale' DESC",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\101227209.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT time_of_day AS 'Time of Day', day AS 'Weekday', count(*) AS 'Total Sale' FROM sales WHERE day NOT IN ('Sunday','Saturday')  group by time_of_day, day ORDER BY 'Total Sale' DESC",conn)

   Time of Day    Weekday  Total Sale
0      Evening  Wednesday          50
1    Afternoon   Thursday          61
2      Evening    Tuesday          60
3    Afternoon  Wednesday          71
4    Afternoon     Friday          68
5      Morning  Wednesday          22
6    Afternoon     Monday          64
7      Morning   Thursday          33
8      Evening     Monday          40
9    Afternoon    Tuesday          62
10     Evening   Thursday          44
11     Morning     Monday          21
12     Morning    Tuesday          36
13     Evening     Friday          42
14     Morning     Friday          29

Q2. Which of the customer types brings the most revenue?

In [73]:
pd.read_sql_query("SELECT customer_type AS 'Customer Type', sum(total) AS 'Total Revenue' FROM sales group by customer_type ORDER BY sum(total) DESC",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_31468\3857388197.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT customer_type AS 'Customer Type', sum(total) AS 'Total Revenue' FROM sales group by customer_type ORDER BY sum(total) DESC",conn)

  Customer Type  Total Revenue
0        Member    164223.4440
1        Normal    158398.2855

Q3. Which city has the largest tax percent/ VAT (Value Added Tax)?

In [9]:
pd.read_sql_query("SELECT city AS City, sum(tax_pct) AS 'Total VAT' FROM sales group by city ORDER BY sum(tax_pct) DESC limit 1",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_66552\2753312609.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT city AS City, sum(tax_pct) AS 'Total VAT' FROM sales group by city ORDER BY sum(tax_pct) DESC limit 1",conn)

        City  Total VAT
0  Naypyitaw  5265.1765

Q4. Which customer type pays the most in VAT?

In [12]:
pd.read_sql_query("SELECT customer_type AS 'Customer Type', sum(tax_pct) AS 'Total VAT' FROM sales group by customer_type ORDER BY sum(tax_pct) DESC limit 1",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_66552\2911475123.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT customer_type AS 'Customer Type', sum(tax_pct) AS 'Total VAT' FROM sales group by customer_type ORDER BY sum(tax_pct) DESC limit 1",conn)

  Customer Type  Total VAT
0        Member   7820.164

## Customer
Q1. How many unique customer types does the data have?

In [14]:
pd.read_sql_query("SELECT distinct customer_type AS 'Customer Types' FROM sales",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_66552\1120407700.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT distinct customer_type AS 'Customer Types' FROM sales",conn)

  Customer Types
0         Normal
1         Member

Q2. How many unique payment methods does the data have?

In [15]:
pd.read_sql_query("SELECT distinct payment AS 'Payment Methods' FROM sales",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_66552\3989716203.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT distinct payment AS 'Payment Methods' FROM sales",conn)

  Payment Methods
0     Credit card
1         Ewallet
2            Cash

Q3. What is the most common customer type?

In [18]:
pd.read_sql_query("SELECT distinct customer_type AS 'Customer Types', count(*) AS Count FROM sales GROUP BY customer_type ORDER BY count(*) DESC",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_66552\1421161836.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT distinct customer_type AS 'Customer Types', count(*) AS Count FROM sales GROUP BY customer_type ORDER BY count(*) DESC",conn)

  Customer Types  Count
0         Member    501
1         Normal    498

Q4. Which customer type buys the most?

In [20]:
pd.read_sql_query("SELECT distinct customer_type AS 'Customer Types', count(*) AS 'Buy Count' FROM sales GROUP BY customer_type ORDER BY count(*) DESC limit 1",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_66552\1816349190.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT distinct customer_type AS 'Customer Types', count(*) AS 'Buy Count' FROM sales GROUP BY customer_type ORDER BY count(*) DESC limit 1",conn)

  Customer Types  Buy Count
0         Member        501

Q5. What is the gender of most of the customers?

In [21]:
pd.read_sql_query("SELECT gender AS Gender, count(*) AS 'Buy Count' FROM sales GROUP BY gender ORDER BY count(*) DESC",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_66552\3957537751.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT gender AS Gender, count(*) AS 'Buy Count' FROM sales GROUP BY gender ORDER BY count(*) DESC",conn)

   Gender  Buy Count
0  Female        500
1    Male        499

Q6. What is the gender distribution per branch?

In [22]:
pd.read_sql_query("SELECT gender AS Gender, branch AS Branch, count(gender) AS 'Gender Count' FROM sales GROUP BY gender, branch ORDER BY count(gender) DESC",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_66552\2047215753.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT gender AS Gender, branch AS Branch, count(gender) AS 'Gender Count' FROM sales GROUP BY gender, branch ORDER BY count(gender) DESC",conn)

   Gender Branch  Gender Count
0    Male      A           179
1  Female      C           178
2    Male      B           170
3  Female      B           161
4  Female      A           161
5    Male      C           150

Q7. Which time of the day do customers give most ratings?

In [23]:
pd.read_sql_query("SELECT time_of_day AS 'Time of the day', avg(rating) AS 'Avg. Rating' FROM sales GROUP BY time_of_day ORDER BY avg(rating) DESC",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_66552\3373989083.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT time_of_day AS 'Time of the day', avg(rating) AS 'Avg. Rating' FROM sales GROUP BY time_of_day ORDER BY avg(rating) DESC",conn)

  Time of the day  Avg. Rating
0       Afternoon      7.00176
1         Morning      6.97474
2         Evening      6.94085

Q8. Which time of the day do customers give most ratings per branch?

In [24]:
pd.read_sql_query("SELECT time_of_day AS 'Time of the day', branch AS Branch, avg(rating) AS 'Avg. Rating' FROM sales GROUP BY time_of_day, branch ORDER BY avg(rating) DESC",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_66552\1210618140.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT time_of_day AS 'Time of the day', branch AS Branch, avg(rating) AS 'Avg. Rating' FROM sales GROUP BY time_of_day, branch ORDER BY avg(rating) DESC",conn)

  Time of the day Branch  Avg. Rating
0         Evening      C      7.11304
1       Afternoon      A      7.09304
2       Afternoon      C      7.07987
3         Morning      A      7.00548
4         Morning      C      6.97458
5         Evening      A      6.94495
6         Morning      B      6.93621
7       Afternoon      B      6.81549
8         Evening      B      6.78626

Q9. Which day fo the week has the best avg ratings?

In [26]:
pd.read_sql_query("SELECT day AS 'Day', avg(rating) AS 'Avg. Rating' FROM sales GROUP BY day ORDER BY avg(rating) DESC limit 1",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_66552\3844966413.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT day AS 'Day', avg(rating) AS 'Avg. Rating' FROM sales GROUP BY day ORDER BY avg(rating) DESC limit 1",conn)

      Day  Avg. Rating
0  Monday       7.1528

Q10. Which day of the week has the best average ratings per branch?

In [29]:
pd.read_sql_query("SELECT day AS 'Day', branch AS Branch, avg(rating) AS 'Avg. Rating' FROM sales GROUP BY day, branch ORDER BY avg(rating) DESC limit 1",conn)

C:\Users\asus\AppData\Local\Temp\ipykernel_66552\416798961.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT day AS 'Day', branch AS Branch, avg(rating) AS 'Avg. Rating' FROM sales GROUP BY day, branch ORDER BY avg(rating) DESC limit 1",conn)

      Day Branch  Avg. Rating
0  Monday      B      7.33333